{ 
    "Disease gene location": {
        "List chromosome locations of the genes related to Distal renal tubular acidosis. Let's decompose the question to sub-questions and solve them step by step.": [
            "17q21.31",
            "7q34"
        ],
        "List chromosome locations of the genes related to Pseudohypoparathyroidism Ic. Let's decompose the question to sub-questions and solve them step by step.": [
            "20q13.32"
        ],
        "List chromosome locations of the genes related to Chronic atrial and intestinal dysrhythmia. Let's decompose the question to sub-questions and solve them step by step.": [
            "3p24.3"
        ],
        "List chromosome locations of the genes related to Sensorineural deafness with mild renal dysfunction. Let's decompose the question to sub-questions and solve them step by step.": [
            "1p32.3"
        ],
        "List chromosome locations of the genes related to Bile acid malabsorption. Let's decompose the question to sub-questions and solve them step by step.": [
            "13q33.1",
            "15q22.31"
        ],
        "List chromosome locations of the genes related to Mitochondrial DNA depletion syndrome 4A Alpers type. Let's decompose the question to sub-questions and solve them step by step.": [
            "15q26.1"
        ],
        "List chromosome locations of the genes related to Gastrointestinal defects and immunodeficiency syndrome. Let's decompose the question to sub-questions and solve them step by step.": [
            "22q11.21",
            "2p21"
        ],
        "List chromosome locations of the genes related to Cleft palate with ankyloglossia. Let's decompose the question to sub-questions and solve them step by step.": [
            "Xq21.1"
        ],
        "List chromosome locations of the genes related to Neurodevelopmental disorder with nonspecific brain abnormalities and with or without seizures. Let's decompose the question to sub-questions and solve them step by step.": [
            "6q27"
        ],
        "List chromosome locations of the genes related to Sialidosis. Let's decompose the question to sub-questions and solve them step by step.": [
            "6p21.33"
        ],
        "List chromosome locations of the genes related to Corneal fleck dystrophy. Let's decompose the question to sub-questions and solve them step by step.": [
            "2q34"
        ],
        "List chromosome locations of the genes related to Type diabetes mellitus. Let's decompose the question to sub-questions and solve them step by step.": [
            "17q12",
            "7p15.3",
            "2q24.1",
            "6p21.31",
            "2q36.3",
            "2q31.3",
            "7p15.3"
        ],
        "List chromosome locations of the genes related to Vascular malformation. Let's decompose the question to sub-questions and solve them step by step.": [
            "20q13.12"
        ],
        "List chromosome locations of the genes related to B-cell immunodeficiency. Let's decompose the question to sub-questions and solve them step by step.": [
            "3p24.2"
        ],
        "List chromosome locations of the genes related to Immunodeficiency with inflammatory disease and congenital thrombocytopenia. Let's decompose the question to sub-questions and solve them step by step.": [
            "7q22.1"
        ],
        "List chromosome locations of the genes related to Superoxide dismutase. Let's decompose the question to sub-questions and solve them step by step.": [
            "4p15.2"
        ],
        "List chromosome locations of the genes related to Leukoencephalopathy with dystonia and motor neuropathy. Let's decompose the question to sub-questions and solve them step by step.": [
            "1p32.3"
        ],
        "List chromosome locations of the genes related to Cone dystrophy. Let's decompose the question to sub-questions and solve them step by step.": [
            "10q23.33",
            "6p21.1"
        ],
        "List chromosome locations of the genes related to Lichtenstein-Knorr syndrome. Let's decompose the question to sub-questions and solve them step by step.": [
            "1p36.11"
        ]
    }
}